# GetCopingIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstance..::..GetCopingIds Method
FamilyInstance Class See Also
---
Lists the elements currently used as coping cutters for this element.
Lists the elements currently used as coping cutters for this element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ICollection<ElementId> GetCopingIds()
```

Visual Basic
---
```text
Public Function GetCopingIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetCopingIds()
```

# ### Return Value
The coping ElementIds
# See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace